{
    "FashionTryOn": [
        {
            "action": "One arm extends outward while the other bends softly, one leg shifting slightly forward, ",
            "outfit": "wearing dark blue pants and a delicate silver bracelet. Keep the upper body clothing exactly as it is, only change the lower body clothes."
        },
        {
            "action": "One hand lifts outward as the other rests lower, a leg angled casually to the side, ",
            "outfit": "wearing beige trousers and small pearl earrings. Keep the upper body clothing exactly as it is, only change the lower body clothes."
        },
        {
            "action": "Arms cross loosely while one leg steps forward with a light sway, ",
            "outfit": "wearing black trousers and a refined gold ring on the right hand. Keep the upper body clothing exactly as it is, only change the lower body clothes."
        },
        {
            "action": "One arm raises in a fluid gesture while the other lowers gently, weight shifted onto one leg, ",
            "outfit": "wearing orange patterned trousers and subtle gold hoop earrings. Keep the upper body clothing exactly as it is, only change the lower body clothes."
        },
        {
            "action": "Arms extend outward in motion while one leg bears more weight, ",
            "outfit": "wearing green trousers and a thin beaded bracelet. Keep the upper body clothing exactly as it is, only change the lower body clothes."
        },
        {
            "action": "Both arms lift slightly with elbows bent, knees relaxed to suggest motion, ",
            "outfit": "wearing navy trousers and a fine gold necklace. Keep the upper body clothing exactly as it is, only change the lower body clothes."
        },
        {
            "action": "One arm reaches forward while the other drifts lightly back, one knee bent, ",
            "outfit": "wearing beige pants and small silver hoop earrings. Keep the upper body clothing exactly as it is, only change the lower body clothes."
        },
        {
            "action": "Both hands come together in front while legs balance in a gentle stance, ",
            "outfit": "wearing white trousers and a slender golden bracelet. Keep the upper body clothing exactly as it is, only change the lower body clothes."
        },
        {
            "action": "One hand lifts while the other lowers naturally, a leg extended slightly outward, ",
            "outfit": "wearing gray pants and small elegant studs. Keep the upper body clothing exactly as it is, only change the lower body clothes."
        },
        {
            "action": "Arms fold loosely while one leg supports a relaxed shift in weight, ",
            "outfit": "wearing dark green pants and a minimalist beaded necklace. Keep the upper body clothing exactly as it is, only change the lower body clothes."
        },
        {
            "action": "One arm waves outward gently, the opposite leg steps softly ahead, ",
            "outfit": "wearing beige trousers and simple silver earrings. Keep the upper body clothing exactly as it is, only change the lower body clothes."
        },
        {
            "action": "Arms rise lightly in a relaxed pose, one leg angled at ease, ",
            "outfit": "wearing gray trousers and a thin silver bracelet. Keep the upper body clothing exactly as it is, only change the lower body clothes."
        },
        {
            "action": "One arm stretches outward while the other rests lower, a leg placed firmly to the side, ",
            "outfit": "wearing black pants and small gold hoop earrings. Keep the upper body clothing exactly as it is, only change the lower body clothes."
        },
        {
            "action": "One arm lifts smoothly while the other drops, one knee bends softly, ",
            "outfit": "wearing gray trousers and a delicate silver chain necklace. Keep the upper body clothing exactly as it is, only change the lower body clothes."
        },
        {
            "action": "One elbow bends with the hand raised, the other arm stretches outward, legs steady in balance, ",
            "outfit": "wearing dark green trousers and a slender ring. Keep the upper body clothing exactly as it is, only change the lower body clothes."
        },
        {
            "action": "One arm crosses gently while the other extends outward, legs shifting in a relaxed pose, ",
            "outfit": "wearing navy pants and a subtle gold bracelet. Keep the upper body clothing exactly as it is, only change the lower body clothes."
        },
        {
            "action": "One hand rests lightly while the other gestures upward, one leg bends casually, ",
            "outfit": "wearing beige trousers and refined beaded earrings. Keep the upper body clothing exactly as it is, only change the lower body clothes."
        },
        {
            "action": "One arm moves outward while the other steadies, both legs in a natural stance, ",
            "outfit": "wearing dark blue trousers and a slim silver wristwatch. Keep the upper body clothing exactly as it is, only change the lower body clothes."
        },
        {
            "action": "Both hands move outward in rhythm, one leg angled slightly to balance, ",
            "outfit": "wearing black trousers and a fine gold bracelet. Keep the upper body clothing exactly as it is, only change the lower body clothes."
        },
        {
            "action": "Both hands rest together softly while one leg shifts weight forward, ",
            "outfit": "wearing green pants and small elegant feather-shaped earrings. Keep the upper body clothing exactly as it is, only change the lower body clothes."
        }
    ],
    "viton": [
        {
            "action": "She leans forward with a playful sway, one arm extended outward while the other hand rests lightly on the waist, ",
            "outfit": "wearing dark blue pants and a delicate silver bracelet."
        },
        {
            "action": "She tilts shoulders dramatically to one side, one hand brushing along the hip while the other lifts gracefully outward, ",
            "outfit": "wearing beige trousers and small pearl earrings."
        },
        {
            "action": "She steps slightly forward, arms crossing loosely with a lively sway of the upper body, ",
            "outfit": "wearing black trousers and a refined gold ring on the right hand."
        },
        {
            "action": "She raises one hand in a fluid gesture near the chest while the other hand rests confidently on the hip, ",
            "outfit": "wearing orange patterned trousers and subtle gold hoop earrings."
        },
        {
            "action": "She shifts weight onto one leg, arms moving outward as if in mid-conversation, posture dynamic and natural, ",
            "outfit": "wearing green trousers and a thin beaded bracelet."
        },
        {
            "action": "She lifts both arms slightly, elbows bent, creating a playful curve through the shoulders and torso, ",
            "outfit": "wearing navy trousers and a fine gold necklace."
        },
        {
            "action": "She rotates gently at the waist, one arm reaching forward while the other moves lightly behind, ",
            "outfit": "wearing beige pants and small silver hoop earrings."
        },
        {
            "action": "She places both hands near the chest in a soft expressive gesture, torso leaning slightly back, ",
            "outfit": "wearing white trousers and a slender golden bracelet."
        },
        {
            "action": "She tilts the upper body to one side, one hand raised near the shoulder while the other rests casually at the waist, ",
            "outfit": "wearing gray pants and small elegant studs."
        },
        {
            "action": "She folds arms loosely while shifting weight to one leg, shoulders angled in a lively but relaxed manner, ",
            "outfit": "wearing dark green pants and a minimalist beaded necklace."
        },
        {
            "action": "She leans slightly forward, one arm extended in a fluid wave, body posture animated yet soft, ",
            "outfit": "wearing beige trousers and simple silver earrings."
        },
        {
            "action": "She shifts shoulders with a playful tilt, arms resting loosely but slightly raised, ",
            "outfit": "wearing gray trousers and a thin silver bracelet."
        },
        {
            "action": "She rotates the upper body, one hand extended outward at chest height, the other resting gracefully at the side, ",
            "outfit": "wearing black pants and small gold hoop earrings."
        },
        {
            "action": "She leans subtly and lightly back, one arm lifted near the collarbone while the other drops naturally downward, ",
            "outfit": "wearing gray trousers and a delicate silver chain necklace."
        },
        {
            "action": "She tilts shoulders forward, one elbow bent with hand raised near the torso, the other arm extended outward in motion, ",
            "outfit": "wearing dark green trousers and a slender ring."
        },
        {
            "action": "She crosses one arm lightly over the waist, the other extended outward in a soft but expressive pose, ",
            "outfit": "wearing navy pants and a subtle gold bracelet."
        },
        {
            "action": "She twists slightly at the torso, one hand placed on the hip, the other gesturing gently upward, ",
            "outfit": "wearing beige trousers and refined beaded earrings."
        },
        {
            "action": "She rests one arm near the chest while the other sweeps outward, posture lively yet balanced, ",
            "outfit": "wearing dark blue trousers and a slim silver wristwatch."
        },
        {
            "action": "She tilts shoulders and leans subtly to one side, both hands moving lightly outward with fluid grace, ",
            "outfit": "wearing black trousers and a fine gold bracelet."
        },
        {
            "action": "She stands with both hands softly brought together near the waist, torso leaning slightly forward, ",
            "outfit": "wearing green pants and small elegant feather-shaped earrings."
        }
    ],
    "DressCode": {
        "dresses": [
            {
                "action": "She steps forward lightly, one arm swinging gently while the other rests on her waist, ",
                "outfit": "wearing a delicate silver bracelet and black high heels. Keep the dress exactly as it is."
            },
            {
                "action": "She turns smoothly on one foot, arms extended outward gracefully, ",
                "outfit": "wearing a thin gold ring and beige high heels. Keep the dress exactly as it is."
            },
            {
                "action": "She walks forward with a cheerful bounce, arms moving naturally, ",
                "outfit": "wearing a refined bracelet and brown sandals. Keep the dress exactly as it is."
            },
            {
                "action": "She twirls gently, one hand on her hip while the other moves outward gracefully, ",
                "outfit": "wearing a subtle gold bangle and black ankle boots. Keep the dress exactly as it is."
            },
            {
                "action": "She steps forward energetically, arms swinging naturally with her movement, ",
                "outfit": "wearing a thin beaded bracelet and nude high heels. Keep the dress exactly as it is."
            },
            {
                "action": "She shifts side to side with a playful step, smiling lightly, ",
                "outfit": "wearing a fine gold necklace and white sneakers. Keep the dress exactly as it is."
            },
            {
                "action": "She rotates at the waist, one arm reaching up while the other trails gently behind, ",
                "outfit": "wearing a minimalist bracelet and pink flat shoes. Keep the dress exactly as it is."
            },
            {
                "action": "She steps lightly, raising both arms in a soft, happy gesture, ",
                "outfit": "wearing a slender golden bracelet and brown sandals. Keep the dress exactly as it is."
            },
            {
                "action": "She leans sideways slightly, one hand near her shoulder while the other lifts naturally, ",
                "outfit": "wearing a thin ring and black flat shoes. Keep the dress exactly as it is."
            },
            {
                "action": "She walks forward with a lively step, arms swinging loosely, shoulders relaxed, ",
                "outfit": "wearing a minimalist bracelet and black ankle boots. Keep the dress exactly as it is."
            },
            {
                "action": "She bounces lightly on the balls of her feet, one arm moving gently in the air, ",
                "outfit": "wearing a simple bracelet and brown high heels. Keep the dress exactly as it is."
            },
            {
                "action": "She steps forward with a lively motion, tilting her head playfully, ",
                "outfit": "wearing a thin silver bracelet and beige sandals. Keep the dress exactly as it is."
            },
            {
                "action": "She turns quickly in place, one arm reaching outward while the other extends gracefully, ",
                "outfit": "wearing a subtle gold ring and black flat shoes. Keep the dress exactly as it is."
            },
            {
                "action": "She lifts her arms slightly as she steps forward, moving with a cheerful energy, ",
                "outfit": "wearing a delicate silver chain bracelet and brown sandals. Keep the dress exactly as it is."
            },
            {
                "action": "She leans forward in a playful stride, one hand lifted while the other swings naturally, ",
                "outfit": "wearing a slender bracelet and nude low heels. Keep the dress exactly as it is."
            },
            {
                "action": "She turns lightly with one hand on her hip, the other extended gently outward, ",
                "outfit": "wearing a subtle gold bracelet and pink flat shoes. Keep the dress exactly as it is."
            },
            {
                "action": "She rotates smoothly on one foot, arms flowing naturally, ",
                "outfit": "wearing a refined beaded bracelet and black ankle boots. Keep the dress exactly as it is."
            },
            {
                "action": "She moves lightly, one hand brushing her hair while the other gestures playfully forward, ",
                "outfit": "wearing a slim silver wristwatch and nude high heels. Keep the dress exactly as it is."
            },
            {
                "action": "She walks forward with an energetic yet natural step, both arms raised slightly, ",
                "outfit": "wearing a fine gold bracelet and white sneakers. Keep the dress exactly as it is."
            },
            {
                "action": "She steps joyfully, landing softly with hands resting near her waist, ",
                "outfit": "wearing a small elegant bracelet and brown high heels. Keep the dress exactly as it is."
            }
        ],
        "lower_body": [
            {
                "action": "The model leans slightly forward with one arm extended outward while the other rests lightly at the side, stepping subtly with one foot.",
                "outfit": "The model is wearing a white cotton blouse with smooth texture, a wristwatch, and black leather sneakers with matte finish. Keep the lower body clothing exactly as it is, only change the upper body clothes or shoes."
            },
            {
                "action": "The model tilts the shoulders gently to one side, one hand brushing along the hip while the other lifts outward, knees slightly bent.",
                "outfit": "The model is wearing a light gray jacket with soft cotton texture, a leather bracelet, and brown suede loafers. Keep the lower body clothing exactly as it is, only change the upper body clothes or shoes."
            },
            {
                "action": "The model steps forward with a subtle bend in the knee, arms crossing loosely in a relaxed gesture.",
                "outfit": "The model is wearing a white cotton shirt with plain texture, a watch, and white canvas sandals. Keep the lower body clothing exactly as it is, only change the upper body clothes or shoes."
            },
            {
                "action": "The model raises one hand in a fluid gesture near the chest while the other rests at the side, feet placed with a soft stance.",
                "outfit": "The model is wearing a gray blouse with smooth cotton texture, a metal ring, and black leather flats. Keep the lower body clothing exactly as it is, only change the upper body clothes or shoes."
            },
            {
                "action": "The model shifts weight onto one leg, both arms moving outward as if mid-conversation, toes angled slightly outward.",
                "outfit": "The model is wearing a beige knitted sweater with visible knit pattern, a bracelet, and beige fabric sneakers. Keep the lower body clothing exactly as it is, only change the upper body clothes or shoes."
            },
            {
                "action": "The model lifts both arms slightly with elbows bent, shoulders curving in a lively gesture, one foot raised on the ball.",
                "outfit": "The model is wearing a light blue cotton blouse with plain texture, a wristwatch, and brown leather ankle boots. Keep the lower body clothing exactly as it is, only change the upper body clothes or shoes."
            },
            {
                "action": "The model rotates gently at the waist, one arm reaching forward while the other moves lightly behind, steps balanced evenly.",
                "outfit": "The model is wearing a beige cotton overshirt with soft texture, a bracelet, and black ballet flats. Keep the lower body clothing exactly as it is, only change the upper body clothes or shoes."
            },
            {
                "action": "The model places both hands near the chest in a soft expressive gesture, torso leaning slightly back, one leg extended forward.",
                "outfit": "The model is wearing a white collared cotton shirt with smooth texture, a wristwatch, and white leather sneakers. Keep the lower body clothing exactly as it is, only change the upper body clothes or shoes."
            },
            {
                "action": "The model tilts the torso to one side, one hand raised near the shoulder while the other rests casually, feet angled inward.",
                "outfit": "The model is wearing a light gray cotton top with plain texture, a metal bracelet, and black sandals with simple straps. Keep the lower body clothing exactly as it is, only change the upper body clothes or shoes."
            },
            {
                "action": "The model folds arms loosely while shifting weight to one leg, posture angled but composed, one knee slightly bent.",
                "outfit": "The model is wearing a white short-sleeve cotton shirt with smooth texture, a wristwatch, and brown suede flats. Keep the lower body clothing exactly as it is, only change the upper body clothes or shoes."
            },
            {
                "action": "The model leans slightly forward with one arm extended in a fluid wave, posture animated yet balanced, foot pointed outward.",
                "outfit": "The model is wearing a white structured blouse with crisp cotton texture, a ring, and nude leather heels. Keep the lower body clothing exactly as it is, only change the upper body clothes or shoes."
            },
            {
                "action": "The model shifts shoulders with a playful tilt, arms resting loosely but slightly raised, one leg crossing lightly over the other.",
                "outfit": "The model is wearing a gray cotton top with plain texture, a leather bracelet, and white canvas sneakers. Keep the lower body clothing exactly as it is, only change the upper body clothes or shoes."
            },
            {
                "action": "The model rotates the torso, one hand extended outward at chest height, the other resting naturally at the side, step held mid-motion.",
                "outfit": "The model is wearing a white buttoned cotton shirt with smooth texture, a wristwatch, and black leather loafers. Keep the lower body clothing exactly as it is, only change the upper body clothes or shoes."
            },
            {
                "action": "The model leans subtly back, one arm lifted while the other drops naturally downward, foot lifted softly off the ground.",
                "outfit": "The model is wearing a beige fitted cotton top with plain texture, a bracelet, and beige sandals with thin straps. Keep the lower body clothing exactly as it is, only change the upper body clothes or shoes."
            },
            {
                "action": "The model tilts shoulders forward, one elbow bent with hand raised while the other arm extends outward, knees slightly angled.",
                "outfit": "The model is wearing a brown narrow-cut cotton shirt with plain texture, a wristwatch, and brown leather flats. Keep the lower body clothing exactly as it is, only change the upper body clothes or shoes."
            },
            {
                "action": "The model crosses one arm lightly over the waist while the other extends outward in a soft gesture, stance wide with feet apart.",
                "outfit": "The model is wearing a white tailored blouse with smooth cotton texture, a bracelet, and black leather ankle boots. Keep the lower body clothing exactly as it is, only change the upper body clothes or shoes."
            },
            {
                "action": "The model twists slightly at the torso, one hand placed on the hip, the other gesturing upward, one heel lifted.",
                "outfit": "The model is wearing a dark gray cotton top with plain texture, a wristwatch, and white sneakers with rubber sole. Keep the lower body clothing exactly as it is, only change the upper body clothes or shoes."
            },
            {
                "action": "The model rests one arm near the chest while the other sweeps outward in motion, steps taken with light movement.",
                "outfit": "The model is wearing a beige cotton overshirt with plain texture, a wristband, and black sandals with flat straps. Keep the lower body clothing exactly as it is, only change the upper body clothes or shoes."
            },
            {
                "action": "The model tilts shoulders and leans subtly to one side, both hands moving outward with fluid grace, one foot pointed forward.",
                "outfit": "The model is wearing a white structured cotton shirt with smooth texture, a bracelet, and nude flats with smooth surface. Keep the lower body clothing exactly as it is, only change the upper body clothes or shoes."
            },
            {
                "action": "The model stands with both hands softly brought together near the waist, torso leaning slightly forward, feet steady apart.",
                "outfit": "The model is wearing a white formal blouse with crisp cotton texture, a wristwatch, and brown suede loafers. Keep the lower body clothing exactly as it is, only change the upper body clothes or shoes."
            }
        ],
        "upper_body": [
            {
                "action": "The model steps lightly forward with one knee bent, one arm reaching outward while the other rests in a relaxed pose.",
                "outfit": "The model is wearing dark wool trousers with a smooth texture, black leather loafers, and a wristwatch. Keep the upper body clothing exactly as it is, only change the lower body clothes or shoes."
            },
            {
                "action": "The model tilts the shoulders with a small sway, one hand brushing the hip while the other arcs outward.",
                "outfit": "The model is wearing navy cotton trousers with a plain color, white canvas sneakers, and a leather bracelet. Keep the upper body clothing exactly as it is, only change the lower body clothes or shoes."
            },
            {
                "action": "The model takes a small step with knees slightly bent, arms folding loosely then opening outward.",
                "outfit": "The model is wearing beige linen trousers with a light texture, brown leather sandals, and a watch. Keep the upper body clothing exactly as it is, only change the lower body clothes or shoes."
            },
            {
                "action": "The model raises one arm in a flowing gesture near the chest while the other rests lightly at the hip, legs shifting in balance.",
                "outfit": "The model is wearing grey wool trousers with a smooth texture, black slip-on sneakers, and a metal ring. Keep the upper body clothing exactly as it is, only change the lower body clothes or shoes."
            },
            {
                "action": "The model shifts weight with a soft bend in one knee, both arms lifting outward as if mid-conversation.",
                "outfit": "The model is wearing olive cotton trousers with a plain color, brown leather loafers, and a bracelet. Keep the upper body clothing exactly as it is, only change the lower body clothes or shoes."
            },
            {
                "action": "The model lifts both arms slightly with elbows bent, one foot angled forward in a lively step.",
                "outfit": "The model is wearing khaki linen trousers with a subtle texture, white mesh sneakers, and a wristwatch. Keep the upper body clothing exactly as it is, only change the lower body clothes or shoes."
            },
            {
                "action": "The model rotates gently at the waist, one arm stretching ahead while the other swings lightly behind, legs turning with the motion.",
                "outfit": "The model is wearing black denim trousers with a matte texture, black leather ankle boots, and a bracelet. Keep the upper body clothing exactly as it is, only change the lower body clothes or shoes."
            },
            {
                "action": "The model leans slightly back on one leg, both hands rising near the chest in a soft expressive motion.",
                "outfit": "The model is wearing grey wool trousers with a smooth texture, brown loafers, and a wristwatch. Keep the upper body clothing exactly as it is, only change the lower body clothes or shoes."
            },
            {
                "action": "The model tilts the torso to one side with a gentle step, one hand lifted near the shoulder while the other rests casually at the waist.",
                "outfit": "The model is wearing beige linen trousers with a light texture, leather sandals, and a metal bracelet. Keep the upper body clothing exactly as it is, only change the lower body clothes or shoes."
            },
            {
                "action": "The model crosses arms loosely while bending one knee, posture balanced yet relaxed.",
                "outfit": "The model is wearing black cotton trousers with a smooth texture, grey slip-on sneakers, and a wristwatch. Keep the upper body clothing exactly as it is, only change the lower body clothes or shoes."
            },
            {
                "action": "The model leans forward into a small step, one arm extended in a wave-like motion, body animated yet steady.",
                "outfit": "The model is wearing dark grey wool trousers with pleats, brown suede loafers, and a ring. Keep the upper body clothing exactly as it is, only change the lower body clothes or shoes."
            },
            {
                "action": "The model shifts shoulders with a playful tilt, arms lifting lightly while one foot slides outward.",
                "outfit": "The model is wearing navy cotton trousers with a plain texture, dark leather sandals, and a leather bracelet. Keep the upper body clothing exactly as it is, only change the lower body clothes or shoes."
            },
            {
                "action": "The model rotates the torso in motion, one hand extending forward at chest height, the other resting at the side, legs following the twist.",
                "outfit": "The model is wearing black denim trousers with a matte finish, white canvas sneakers, and a wristwatch. Keep the upper body clothing exactly as it is, only change the lower body clothes or shoes."
            },
            {
                "action": "The model leans subtly back with one leg stepping behind, one arm lifted upward while the other drops gracefully.",
                "outfit": "The model is wearing grey wool trousers with a smooth texture, black slip-on loafers, and a bracelet. Keep the upper body clothing exactly as it is, only change the lower body clothes or shoes."
            },
            {
                "action": "The model tilts shoulders forward, one elbow bent with hand raised while the opposite arm extends outward, knees slightly bent.",
                "outfit": "The model is wearing khaki cotton trousers with a plain texture, brown leather sandals, and a wristwatch. Keep the upper body clothing exactly as it is, only change the lower body clothes or shoes."
            },
            {
                "action": "The model crosses one arm lightly over the waist while stepping forward, the other arm extending outward in a gentle arc.",
                "outfit": "The model is wearing dark wool trousers with a smooth texture, black leather loafers, and a bracelet. Keep the upper body clothing exactly as it is, only change the lower body clothes or shoes."
            },
            {
                "action": "The model twists slightly at the torso, one hand placed on the hip, the other gesturing upward, one leg bent with weight shifted.",
                "outfit": "The model is wearing navy cotton trousers with a plain texture, white mesh sneakers, and a wristwatch. Keep the upper body clothing exactly as it is, only change the lower body clothes or shoes."
            },
            {
                "action": "The model rests one arm near the chest while the other sweeps outward in motion, feet stepping softly apart.",
                "outfit": "The model is wearing black denim trousers with a matte finish, black ankle boots, and a wristband. Keep the upper body clothing exactly as it is, only change the lower body clothes or shoes."
            },
            {
                "action": "The model tilts shoulders while leaning gently to one side, both arms opening outward, one knee bent in rhythm.",
                "outfit": "The model is wearing grey wool trousers with a smooth texture, brown suede loafers, and a bracelet. Keep the upper body clothing exactly as it is, only change the lower body clothes or shoes."
            },
            {
                "action": "The model stands with both hands softly brought together near the waist, one leg stepping slightly forward with a gentle lean.",
                "outfit": "The model is wearing beige linen trousers with a light texture, grey sneakers, and a wristwatch. Keep the upper body clothing exactly as it is, only change the lower body clothes or shoes."
            }
        ]
    }
}